# Main Code

In [2]:
import pandas as pd
import requests
from bs4 import BeautifulSoup

In [4]:
url = 'https://www.spotrac.com/mlb/rankings/2021/salary/batters/'

In [5]:
res = requests.get(url)

print(res.status_code)

200

In [6]:
soup = BeautifulSoup(res.content, 'lxml')

In [7]:
table = soup.find('table')

In [10]:
batters = []

for row in table.find('tbody').find_all('tr'):
    batter = {}
    batter['name'] = row.find('span').text.strip()
    batter['salary'] = row.find('span', {'class':'info'}).text.strip()
    
    batters.append(batter)
    
pd.DataFrame(batters)

          name       salary
0        Trout  $37,166,667
1      Arenado  $35,025,000
2      Machado  $32,000,000
3      Cabrera  $30,000,000
4       Altuve  $29,000,000
..         ...          ...
95     Moncada   $6,800,000
96      Lawlar   $6,713,300
97       Mayer   $6,664,000
98   Contreras   $6,650,000
99  Benintendi   $6,600,000

[100 rows x 2 columns]